## staging: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 24 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                               |
|--------|-----------------------------------------------------------------|
| add    | `aws_cloudwatch_metric_alarm.db-free-local-storage-critical[0]` |
|        | `aws_cloudwatch_metric_alarm.db-free-local-storage-critical[1]` |
|        | `aws_cloudwatch_metric_alarm.db-free-local-storage-critical[2]` |
|        | `aws_cloudwatch_metric_alarm.db-free-local-storage-warning[0]`  |
|        | `aws_cloudwatch_metric_alarm.db-free-local-storage-warning[1]`  |
|        | `aws_cloudwatch_metric_alarm.db-free-local-storage-warning[2]`  |
|        | `aws_cloudwatch_metric_alarm.high-db-cpu-critical[0]`           |
|        | `aws_cloudwatch_metric_alarm.high-db-cpu-critical[1]`           |
|        | `aws_cloudwatch_metric_alarm.high-db-cpu-critical[2]`           |
|        | `aws_cloudwatch_metric_alarm.high-db-cpu-warning[0]`            |
|        | `aws_cloudwatch_metric_alarm.high-db-cpu-warning[1]`            |
|        | `aws_cloudwatch_metric_alarm.high-db-cpu-warning[2]`            |
|        | `aws_cloudwatch_metric_alarm.high-dbload-critical[0]`           |
|        | `aws_cloudwatch_metric_alarm.high-dbload-critical[1]`           |
|        | `aws_cloudwatch_metric_alarm.high-dbload-critical[2]`           |
|        | `aws_cloudwatch_metric_alarm.high-dbload-warning[0]`            |
|        | `aws_cloudwatch_metric_alarm.high-dbload-warning[1]`            |
|        | `aws_cloudwatch_metric_alarm.high-dbload-warning[2]`            |
|        | `aws_cloudwatch_metric_alarm.low-db-memory-critical[0]`         |
|        | `aws_cloudwatch_metric_alarm.low-db-memory-critical[1]`         |
|        | `aws_cloudwatch_metric_alarm.low-db-memory-critical[2]`         |
|        | `aws_cloudwatch_metric_alarm.low-db-memory-warning[0]`          |
|        | `aws_cloudwatch_metric_alarm.low-db-memory-warning[1]`          |
|        | `aws_cloudwatch_metric_alarm.low-db-memory-warning[2]`          |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/13058635700).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.db-free-local-storage-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "db-free-local-storage-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Free local storage of instance is less than 5GB"
      + alarm_name                            = "db-free-local-storage-critical-instance-0"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-0"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "FreeLocalStorage"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 5368709120
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.db-free-local-storage-critical[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "db-free-local-storage-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Free local storage of instance is less than 5GB"
      + alarm_name                            = "db-free-local-storage-critical-instance-1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-1"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "FreeLocalStorage"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 5368709120
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.db-free-local-storage-critical[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "db-free-local-storage-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Free local storage of instance is less than 5GB"
      + alarm_name                            = "db-free-local-storage-critical-instance-2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-2"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "FreeLocalStorage"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 5368709120
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.db-free-local-storage-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "db-free-local-storage-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Free local storage of instance is less than 10GB"
      + alarm_name                            = "db-free-local-storage-warning-instance-0"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-0"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "FreeLocalStorage"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 10737418240
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.db-free-local-storage-warning[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "db-free-local-storage-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Free local storage of instance is less than 10GB"
      + alarm_name                            = "db-free-local-storage-warning-instance-1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-1"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "FreeLocalStorage"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 10737418240
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.db-free-local-storage-warning[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "db-free-local-storage-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Free local storage of instance is less than 10GB"
      + alarm_name                            = "db-free-local-storage-warning-instance-2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-2"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "FreeLocalStorage"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 10737418240
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.high-db-cpu-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "high-db-cpu-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "CPU usage of the RDS instance > 80%"
      + alarm_name                            = "high-db-cpu-critical-instance-0"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-0"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 80
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.high-db-cpu-critical[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "high-db-cpu-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "CPU usage of the RDS instance > 80%"
      + alarm_name                            = "high-db-cpu-critical-instance-1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-1"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 80
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.high-db-cpu-critical[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "high-db-cpu-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "CPU usage of the RDS instance > 80%"
      + alarm_name                            = "high-db-cpu-critical-instance-2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-2"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 80
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.high-db-cpu-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "high-db-cpu-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "CPU usage of the RDS instance > 50%"
      + alarm_name                            = "high-db-cpu-warning-instance-0"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-0"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.high-db-cpu-warning[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "high-db-cpu-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "CPU usage of the RDS instance > 50%"
      + alarm_name                            = "high-db-cpu-warning-instance-1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-1"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.high-db-cpu-warning[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "high-db-cpu-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "CPU usage of the RDS instance > 50%"
      + alarm_name                            = "high-db-cpu-warning-instance-2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-2"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.high-dbload-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "high-dbload-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "DBLoad > 100. Check if there's a query that is causing this."
      + alarm_name                            = "high-dbload-critical-instance-0"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-0"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DBLoad"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 100
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.high-dbload-critical[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "high-dbload-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "DBLoad > 100. Check if there's a query that is causing this."
      + alarm_name                            = "high-dbload-critical-instance-1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-1"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DBLoad"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 100
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.high-dbload-critical[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "high-dbload-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "DBLoad > 100. Check if there's a query that is causing this."
      + alarm_name                            = "high-dbload-critical-instance-2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-2"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DBLoad"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 100
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.high-dbload-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "high-dbload-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "DBLoad > 1. Check if there's a query that is causing this."
      + alarm_name                            = "high-dbload-warning-instance-0"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-0"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DBLoad"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.high-dbload-warning[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "high-dbload-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "DBLoad > 1. Check if there's a query that is causing this."
      + alarm_name                            = "high-dbload-warning-instance-1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-1"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DBLoad"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.high-dbload-warning[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "high-dbload-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "DBLoad > 1. Check if there's a query that is causing this."
      + alarm_name                            = "high-dbload-warning-instance-2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-2"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DBLoad"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.low-db-memory-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "low-db-memory-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Freeable memory of the RDS instance < 2G"
      + alarm_name                            = "low-db-memory-critical-instance-0"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-0"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "FreeableMemory"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 2147483648
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.low-db-memory-critical[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "low-db-memory-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Freeable memory of the RDS instance < 2G"
      + alarm_name                            = "low-db-memory-critical-instance-1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-1"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "FreeableMemory"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 2147483648
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.low-db-memory-critical[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "low-db-memory-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "Freeable memory of the RDS instance < 2G"
      + alarm_name                            = "low-db-memory-critical-instance-2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-2"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "FreeableMemory"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 2147483648
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.low-db-memory-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "low-db-memory-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Freeable memory of the RDS instance < 4G"
      + alarm_name                            = "low-db-memory-warning-instance-0"
      + arn                                   = (known after apply)
      +...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.logs_exports"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-critical[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-critical[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-db-cpu-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-db-cpu-critical[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-db-cpu-critical[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-db-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-db-cpu-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-db-cpu-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-critical[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-critical[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-warning[2]"]
WARN -...
```

</details>
